{
    "commentary_data": [
        "[10통과1-01-01] 원자와 우주를 시간과 공간 차원에서 비교하면서 규모(scale)의 의미와 필요성을 소개하고, 시간과 공간을 측정하려는 과학자들의 노력이 인간의 경험 범위를 얼마나 확장했는지를 설명한다.",
        "[10통과1-01-02] 과학의 기본량으로 시간, 길이, 질량, 전류, 온도 등 초⋅중학교 과학 교과에서 이미 학습한 내용을 중심으로 다루며, 부피, 속력, 농도 등과 같은 초⋅중⋅고등학교 과학 교과의 주요 과학 개념들이 이러한 기본량으로부터 도출됨을 설명한다.",
        "[10통과1-01-04] 인간을 둘러싼 자연계의 변화가 전달될 때 신호가 되고, 이를 측정하여 분석할 때 정보가 됨을 다룬다. 센서를 통해 아날로그 형태의 다양한 신호가 전기 신호로 바뀌어 디지털 정보가 됨을 소개하며, 센서의 작동 원리는 다루지 않는다.", "[10통과1-02-01] 분광기를 활용하여 수소의 선스펙트럼을 관찰하고 이를 우주 전역의 선스펙트럼을 관찰한 결과 자료와 비교함으로써 우주 진화 초기에 만들어진 수소와 헬륨이 현재 우주의 주요 구성 원소임을 파악하게 한다.",
        "[10통과1-02-02] 별의 진화 과정에서 별 내부의 핵융합을 통해 탄소, 질소, 산소가 생성되는 것을 정성적으로 다루고, 초신성 폭발의 결과로 철보다 무거운 원소가 만들어짐을 다룬다.",
        "[10통과1-02-03] 주기율표의 1족과 17족 원소를 통해 동족 원소는 유사한 화학적 성질을 가진다는 것을 다룬다. 주요 원소들이 화학 결합을 형성하는 이유를 전자껍질 모형을 이용한 전자배치를 통해 안정성을 지닌 원소와 비교하여 설명한다.",
        "[10통과1-02-04] 각 화학 결합으로 나타나는 성질은 전기 전도성에 한정하여 다룬다.",
        "[10통과1-03-01∼02] 지구시스템을 구성하는 권역들의 성층구조를 파악하게 한다. 기권, 수권 등 각 권역이 상호작용하는 과정의 에너지 흐름과 물질 순환으로 인해 지표의 변화, 날씨의 변화 등과 같은 여러 가지 과학적 현상이 일어남을 다룬다.",
        "[10통과1-03-03] 지구 표면을 향해 낙하하거나 지구 주위를 공전하는 원운동은 모두 중력에 의한 지구 중심 방향의 가속도 운동임을 설명한다.",
        "[10통과1-03-04] 일상생활의 역학 시스템에서 물체의 관성 및 충돌에 의한 안전사고 예방을 위한 대비책 및 장치를 고안할 때 관성 법칙과 충격량을 활용하게 한다.",
        "[10통과1-03-05] 생명 시스템의 기본 단위인 세포에서 일어나는 화학 반응에 효소가 필요하고, 세포막을 통한 선택적 투과를 통해 물질 출입이 일어남을 학습한다.",
        "[10통과1-03-06] 전사와 번역을 통해 유전물질로부터 단백질이 만들어지는 과정에 대해 학습하고, 생명 시스템의 유지를 위한 세포 내 정보의 흐름이 체계적으로 구성되어 있음을 이해한다.",
        "[10통과2-01-02] 변이의 발생과 자연선택 과정에 대한 모의실험을 수행하고 다윈의 자연선택설을 중심으로 생물의 진화를 학습한다. 생물다양성을 유전적 다양성, 종 다양성, 생태계 다양성으로 설명하고, 생물다양성을 보전하기 위한 구체적인 사례와 실천 방안을 탐색한다.",
        "[10통과2-01-03] 산화⋅환원 반응을 산소와 전자의 이동으로 설명하되, 산화수는 다루지 않는다.",
        "[10통과2-01-04] 산⋅염기 정의는 아레니우스 정의만 다루고, 중화 반응 과정에서의 변화는 용액의 온도 변화와 지시약의 색 변화만을 다룬다.",
        "[10통과2-01-05] 화학 반응의 열 출입에서 열화학 반응식, 엔탈피를 다루지 않는다.",
        "[10통과2-02-01] 생태계 구성요소들이 서로 영향을 주고받음을 생물과 환경 사이의 상호 관계를 중심으로 학습한다.",
        "[10통과2-02-04] 태양에서 수소가 헬륨으로 핵융합하는 과정에서 질량이 줄어서 태양 에너지가 생성됨을 정성적으로만 다룬다.",
        "[10통과2-02-05] 코일을 통과하는 자기장의 세기가 변할 때 유도되는 전류를 관찰하여 전자기 유도 현상을 정성적으로 이해하고, 이를 이용한 간이 발전기를 만들어 발전소에서 전기 에너지를 만드는 방법을 설명한다.",
        "[10통과2-02-06] 에너지가 다양한 형태로 존재하고, 에너지가 다른 형태로 전환되는 과정에서 에너지의 총량이 보존됨을 일상생활의 사례 중심으로 설명한다. 에너지가 사용되는 과정에서 열이 발생하며 특히 화석 연료의 사용 과정에서 버려지는 열에너지로 인해 에너지 이용의 효율이 낮아진다는 것을 설명한다.",
        "[10통과2-03-02] 과학 실험, 기상 관측, 유전체 분석, 신약 개발 등과 같은 분야에서 많은 정보를 디지털 형태로 전환하여 대량의 데이터를 축적할 수 있게 되면서, 일상생활의 다양한 분야에서 폭넓게 활용할 수 있음을 소개한다.",
        "[10공수1-02-02] 이차방정식은 계수가 실수인 경우만 다루고, 이차방정식은 복소수 범위에서 항상 근을 갖는다는 것을 이해하게 한다.",
        "[10공수1-02-06] 이차함수의 최대, 최소는 제한된 범위에서만 다룬다.",
        "[10공수1-02-07] 삼차방정식과 사차방정식은 계수가 실수인 경우만 다루고, 인수분해 공식이나 인수정리, 조립제법을 이용하여 풀 수 있는 경우만을 다룬다.",
        "[10공수1-02-08] 미지수가 2개인 연립이차방정식은 일차식과 이차식이 각각 한 개씩 주어진 경우, 두 이차식 중 한 이차식이 간단히 인수분해 되는 경우만 다룬다.",
        "[10공수1-04-02] 행렬의 연산에서는 행렬의 덧셈, 뺄셈, 실수배 및 곱셈을 다루고, 행과 열의 수가 각각 2를 넘지 않는 범위에서 행렬의 곱셈을 할 수 있게 한다.",
        "[10공수2-01-01] 선분의 내분을 도입하기 전에 두 점 사이의 거리를 구하는 방법을 다루고, 내분은 수직선 위에서, 좌표평면 위에서 구할 수 있도록 점차 확장하여 다룬다.",
        "[10공수2-02-03] 집합의 연산은 합집합, 교집합, 여집합, 차집합을 다루고, 집합의 연산에 관한 교환법칙, 결합법칙, 분배법칙, 드모르간의 법칙은 벤 다이어그램으로 확인하는 정도로 간단히 다룬다.",
        "[10공수2-02-04] 명제와 조건의 뜻은 수학적인 문장을 이해하는 수준에서 간단히 다룬다. ‘모든’, ‘어떤’을 포함한 명제는 구체적인 상황을 이용하여 도입한다.",
        "[10공수2-02-07] 대우를 이용한 증명법과 귀류법을 이용한 명제의 증명은 간단한 것만 다룬다.",
        "[10공수2-03-01] 함수의 개념은 중학교에서 학습한 내용을 확장하여 주어진 두 집합 사이의 대응 관계로 이해하게 한다.",
        "[10공수1-01-03] 다항식의 인수분해는 다음의 경우를 다룬다. 완전제곱식: x^2 + b^2 + c^2 + 2ab + 2bc + 2ca = (a + b + c)^2, 세제곱 공식 (합의 세제곱)a^3 + 3a^2b + 3ab^2 + b^3 = (a + b)^3, 세제곱 공식 (차의 세제곱),a^3 - 3a^2b + 3ab^2 - b^3 = (a - b)^3, 합차 공식 (합의 인수분해): a^3 + b^3 = (a + b)(a^2 - ab + b^2), 합차 공식 (차의 인수분해): a^3 - b^3 = (a - b)(a^2 + ab + b^2)",
        "[10공수2-03-04] 유리식은 유리함수의 의미를 이해할 수 있을 정도로 간단히 다루고, 유리함수는 y = (ax + b) / (cx + d) 의 기본적인 형태를 중심으로 간단한 문제만 다룬다.",
        "[10공수2-03-05] 무리식은 무리함수의 의미를 이해할 수 있을 정도로 간단히 다루고, 무리함수는 y = √(ax + b) + c 의 기본적인 형태를 중심으로 간단한 문제만 다룬다."
    ]
}